In [1]:
import pandas as pd

In [2]:
f=lambda x: x.max()-x.min()#匿名函数

In [4]:
import numpy as np
frame=pd.DataFrame(np.random.randn(4,3),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])
frame

               b         d         e
Utah   -1.069877 -1.078506 -1.246260
Ohio    0.418270 -1.909030  0.397879
Texas  -1.602586 -0.968021 -0.579530
Oregon -0.147566 -0.548125 -1.755747

In [5]:
frame.apply(f)

b    2.020856
d    1.360905
e    2.153626
dtype: float64

In [6]:
frame.apply(f,axis='columns')

Utah      0.176383
Ohio      2.327299
Texas     1.023056
Oregon    1.608182
dtype: float64

In [7]:
def f(x):
    return pd.Series([x.min(),x.max()],index=['min','max'])

In [8]:
frame.apply(f)

            b         d         e
min -1.602586 -1.909030 -1.755747
max  0.418270 -0.548125  0.397879

In [9]:
frame

               b         d         e
Utah   -1.069877 -1.078506 -1.246260
Ohio    0.418270 -1.909030  0.397879
Texas  -1.602586 -0.968021 -0.579530
Oregon -0.147566 -0.548125 -1.755747

In [10]:
format=lambda x:'%.2f'%x

In [11]:
frame.applymap(format)

            b      d      e
Utah    -1.07  -1.08  -1.25
Ohio     0.42  -1.91   0.40
Texas   -1.60  -0.97  -0.58
Oregon  -0.15  -0.55  -1.76

In [12]:
df=pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=['a','b','c','d'],columns=['one','two'])

In [13]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [14]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [15]:
df.sum(axis=1)  #NA值会被自动排除

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [16]:
df.sum(axis='columns',skipna=False) #禁用自动排除功能

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [17]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [18]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [20]:
obj=pd.Series(['c','a','d','a','a','b','b','c','c'])

In [21]:
uniques=obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [22]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [23]:
pd.value_counts(obj.values,sort=False)

a    3
d    1
b    2
c    3
dtype: int64

In [24]:
string_data=pd.Series(['arrdvark','artichoke',np.nan,'avocado'])
string_data

0     arrdvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [26]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [28]:
string_data[0]=None
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [29]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [32]:
from numpy import nan as NA
data=pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [33]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [34]:
data=pd.DataFrame([[1,6.5,3],[1,NA,NA],[NA,NA,NA],[NA,6.5,3]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [35]:
cleaned=data.dropna()

In [37]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [38]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [40]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [41]:
df=pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df

          0         1         2
0  0.225391       NaN       NaN
1 -0.672555       NaN       NaN
2 -1.365039       NaN  0.402085
3  1.908067       NaN -0.344938
4 -0.581850  0.737171 -0.192792
5 -0.763625 -0.626046 -0.886298
6  1.579940 -1.070598  2.031323

In [42]:
df.dropna()

          0         1         2
4 -0.581850  0.737171 -0.192792
5 -0.763625 -0.626046 -0.886298
6  1.579940 -1.070598  2.031323

In [43]:
df.dropna(thresh=1)

          0         1         2
0  0.225391       NaN       NaN
1 -0.672555       NaN       NaN
2 -1.365039       NaN  0.402085
3  1.908067       NaN -0.344938
4 -0.581850  0.737171 -0.192792
5 -0.763625 -0.626046 -0.886298
6  1.579940 -1.070598  2.031323

In [44]:
df.dropna(thresh=2)

          0         1         2
2 -1.365039       NaN  0.402085
3  1.908067       NaN -0.344938
4 -0.581850  0.737171 -0.192792
5 -0.763625 -0.626046 -0.886298
6  1.579940 -1.070598  2.031323

In [45]:
df.dropna(thresh=3) #     thresh： axis中至少有thresh个非缺失值，否则删除

          0         1         2
4 -0.581850  0.737171 -0.192792
5 -0.763625 -0.626046 -0.886298
6  1.579940 -1.070598  2.031323

In [46]:
df

          0         1         2
0  0.225391       NaN       NaN
1 -0.672555       NaN       NaN
2 -1.365039       NaN  0.402085
3  1.908067       NaN -0.344938
4 -0.581850  0.737171 -0.192792
5 -0.763625 -0.626046 -0.886298
6  1.579940 -1.070598  2.031323

In [49]:
df.dropna(axis=1,thresh=3)

          0         1         2
0  0.225391       NaN       NaN
1 -0.672555       NaN       NaN
2 -1.365039       NaN  0.402085
3  1.908067       NaN -0.344938
4 -0.581850  0.737171 -0.192792
5 -0.763625 -0.626046 -0.886298
6  1.579940 -1.070598  2.031323

In [1]:
import pandas as pd

In [16]:
!type example\ex2.csv #将原始文件内容打印到屏幕上

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [24]:
df=pd.read_csv('example/ex2.csv')
df

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [31]:
pd.read_table('example/ex1.csv',sep=',')

D:\Program Files (x86)\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [32]:
list(open('example/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [35]:
pd.read_table('example/ex3.txt',sep='\s+')

D:\Program Files (x86)\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [36]:
pd.read_table('example/ex3.txt')

D:\Program Files (x86)\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.
  """Entry point for launching an IPython kernel.

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [37]:
pd.read_table('example/ex3.txt',sep=',')

D:\Program Files (x86)\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [41]:
data=pd.read_table('example/ex5.csv',sep=',')

D:\Program Files (x86)\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

In [39]:
!type example\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [42]:
data.to_csv('example/out.csv')

In [43]:
!type example\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [44]:
import sys

In [47]:
data.to_csv(sys.stdout,sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [48]:
!type example\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo